#+TITLE: Global configs
#+DESCRIPTION: Emacs configs
#+AUTHOR: Cesar Munoz
#+PROPERTY: header-args:emacs-lisp :lexical t

** Dashboard
#+BEGIN_SRC emacs-lisp
    ;; Configuración del `dashboard` en Emacs usando `elpaca`
  (setq user-full-name "Cesar M.")
  (setq dashboard-icon-type 'all-the-icons) ;; Usa `all-the-icons` para íconos personalizados.

  (use-package dashboard
    :ensure t
    :config
    ;; Configuración básica de banner y título
    ;(global-page-break-lines-mode 1) ;; Habilita líneas de página a nivel global (requiere `page-break-lines`)

    ;; Configuración de banner
    (setq dashboard-startup-banner 'logo) ;; Usa el logo de Emacs
    (setq dashboard-banner-logo-title (format "Buen día %s" user-full-name))
    (setq dashboard-center-content t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)

    ;; Configura los elementos a mostrar en el dashboard
    (setq dashboard-items '((recents   . 5)
                            (bookmarks . 5)
                            (agenda    . 5)
                            (projects  . 5)
                            (registers . 5)))

    ;; Habilita el dashboard en el inicio
    (dashboard-setup-startup-hook)

    ;; Configuración de íconos y navegación
    (setq dashboard-set-init-info t)
    (setq dashboard-set-navigator t)
    (setq dashboard-navigator-buttons
          `(
            ((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
              "GitHub" "Visitar mi GitHub" (lambda (&rest _) (browse-url "https://github.com/kascesar")))
             (,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
              "LinkedIn" "Visitar mi LinkedIn" (lambda (&rest _) (browse-url "https://linkedin.com/in/csarmaraya")))
             (,(all-the-icons-faicon "envelope" :height 1.1 :v-adjust 0.0)
              "Email" "Enviar un correo" (lambda (&rest _) (compose-mail))))))

    ;; Personaliza el orden de widgets
    (setq dashboard-startupify-list
          '(dashboard-insert-banner
            dashboard-insert-newline
            dashboard-insert-banner-title
            dashboard-insert-navigator
            dashboard-insert-init-info
            dashboard-insert-items
            dashboard-insert-footer))
  )
  (setq dashboard-projects-backend 'projectile)

  ;; Navegacion con jkli en dashboard
  (add-hook 'dashboard-mode-hook
            (lambda ()
              (local-set-key (kbd "i") #'dashboard-previous-line)
              (local-set-key (kbd "k") #'dashboard-next-line)
              (local-set-key (kbd "l") #'dashboard-return)
              (local-set-key (kbd "j") #'dashboard-next-line)))
#+END_SRC

#+RESULTS:
: [nil 26400 1981 776364 nil elpaca-process-queues nil nil 323000 nil]

